Обработки/Reports/_РейтингиБумагКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РейтингиБумагКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтинговыеАгентства</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиЭмитента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиОригинатора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьРейтингамиГаранта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РейтингиБумагКлиентов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Рейтинги бумаг клиентов",
		"1.03",
		"",
		Истина);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Начало сессии статистики
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыВыполнения	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Сессия	 			= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	
	// Формирование
	
	#Область Текст_запроса
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ДействующиеСчетаДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ТекущаяДата,
		|				Организация = &Организация
		|					И &БезФильтраКлиентов = ЛОЖЬ) КАК КлиентыДУ
		|		ПО (КлиентыДУ.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	&Организация В (СчетаДоверительногоУправления.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &ТекущаяДата
		|	И (СчетаДоверительногоУправления.ДатаРасторжения > &ТекущаяДата
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|	И (&БезФильтраКлиентов
		|			ИЛИ КлиентыДУ.Клиент В (&Клиенты))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиценныхБумагОстатки.Организация КАК Организация,
		|	ОстаткиценныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиценныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ОстаткиЦенныхБумаг
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), СЕКУНДА, 1),
		|			(Организация, СчетДоверительногоУправления) В
		|				(ВЫБРАТЬ
		|					_ДействующиеСчетаДоверительногоУправления.Организация,
		|					_ДействующиеСчетаДоверительногоУправления.СчетДоверительногоУправления
		|				ИЗ
		|					_ДействующиеСчетаДоверительногоУправления)) КАК ОстаткиценныхБумагОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления,
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	Эмитенты.ЮрФизЛицо КАК Эмитент,
		|	Облигации.Оригинатор КАК Оригинатор,
		|	Облигации.Гарант КАК Гарант
		|ПОМЕСТИТЬ _РеквизитыБумаг
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = Акции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = Векселя.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = ДепозитарныеРасписки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО _ОстаткиЦенныхБумаг.ЦеннаяБумага = ИпотечныеСертификатыУчастия.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
		|		ПО (Эмитенты.Ссылка = ВЫБОР
		|				КОГДА _ОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|					ТОГДА Акции.Эмитент
		|				КОГДА _ОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|					ТОГДА Облигации.Эмитент
		|				КОГДА _ОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|					ТОГДА Векселя.Эмитент
		|				КОГДА _ОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|					ТОГДА ДепозитарныеРасписки.Эмитент
		|				КОГДА _ОстаткиЦенныхБумаг.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|					ТОГДА ИпотечныеСертификатыУчастия.Эмитент
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РеквизитыБумаг.ЦеннаяБумага КАК Субъект
		|ПОМЕСТИТЬ _СубъектыРейтинга
		|ИЗ
		|	_РеквизитыБумаг КАК _РеквизитыБумаг
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_РеквизитыБумаг.Эмитент
		|ИЗ
		|	_РеквизитыБумаг КАК _РеквизитыБумаг
		|ГДЕ
		|	_РеквизитыБумаг.Эмитент <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_РеквизитыБумаг.Оригинатор
		|ИЗ
		|	_РеквизитыБумаг КАК _РеквизитыБумаг
		|ГДЕ
		|	_РеквизитыБумаг.Оригинатор <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_РеквизитыБумаг.Гарант
		|ИЗ
		|	_РеквизитыБумаг КАК _РеквизитыБумаг
		|ГДЕ
		|	_РеквизитыБумаг.Гарант <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рейтинги.Субъект КАК Субъект,
		|	Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	Рейтинги.Шкала КАК Шкала,
		|	Рейтинги.Шкала.ТипШкалы КАК ТипШкалы,
		|	Рейтинги.Шкала.ВидРейтинга КАК ВидРейтинга,
		|	Рейтинги.ЗначениеРейтинга КАК Рейтинг,
		|	Рейтинги.ЗначениеРейтинга.Оценка КАК ОценкаРейтинга
		|ПОМЕСТИТЬ _Рейтинги
		|ИЗ
		|	РегистрСведений.Рейтинги.СрезПоследних(
		|			&ТекущаяДата,
		|			(Субъект, Агрегатор) В
		|					(ВЫБРАТЬ
		|						_СубъектыРейтинга.Субъект,
		|						ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.РуДата)
		|					ИЗ
		|						_СубъектыРейтинга)
		|				И (Шкала.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ Шкала.ДатаПереходаВАрхив > &ТекущаяДата)) КАК Рейтинги
		|ГДЕ
		|	Рейтинги.Шкала.Срок = ЗНАЧЕНИЕ(Перечисление.СрокиРейтингов.Долгосрочный)
		|	И Рейтинги.ЗначениеРейтинга.РейтингСнят = ЛОЖЬ
		|	И (Рейтинги.ДатаПереходаВАрхив > &ТекущаяДата
		|			ИЛИ Рейтинги.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|	И (Рейтинги.ЗначениеРейтинга.ДатаПереходаВАрхив > &ТекущаяДата
		|			ИЛИ Рейтинги.ЗначениеРейтинга.ДатаПереходаВАрхив = ДАТАВРЕМЯ(1, 1, 1))
		|	И (&БезФильтраРейтинговыхАгентств
		|			ИЛИ Рейтинги.РейтинговоеАгентство В (&РейтинговыеАгентства))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Рейтинги.Субъект КАК Субъект,
		|	_Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	_Рейтинги.ТипШкалы КАК ТипШкалы,
		|	_Рейтинги.ВидРейтинга КАК ВидРейтинга,
		|	_Рейтинги.Рейтинг КАК Рейтинг,
		|	_Рейтинги.ОценкаРейтинга КАК ОценкаРейтинга
		|ПОМЕСТИТЬ _ЛучшиеРейтинги
		|ИЗ
		|	_Рейтинги КАК _Рейтинги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_Рейтинги.Субъект КАК Субъект,
		|			_Рейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|			_Рейтинги.ТипШкалы КАК ТипШкалы,
		|			_Рейтинги.ВидРейтинга КАК ВидРейтинга,
		|			МИНИМУМ(_Рейтинги.ОценкаРейтинга) КАК ОценкаРейтинга
		|		ИЗ
		|			_Рейтинги КАК _Рейтинги
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_Рейтинги.Субъект,
		|			_Рейтинги.РейтинговоеАгентство,
		|			_Рейтинги.ТипШкалы,
		|			_Рейтинги.ВидРейтинга) КАК ЛучшиеРейтинги
		|		ПО (ЛучшиеРейтинги.Субъект = _Рейтинги.Субъект)
		|			И (ЛучшиеРейтинги.РейтинговоеАгентство = _Рейтинги.РейтинговоеАгентство)
		|			И (ЛучшиеРейтинги.ТипШкалы = _Рейтинги.ТипШкалы)
		|			И (ЛучшиеРейтинги.ВидРейтинга = _Рейтинги.ВидРейтинга)
		|			И (ЛучшиеРейтинги.ОценкаРейтинга = _Рейтинги.ОценкаРейтинга)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЦенныхБумаг.Организация КАК Организация,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	""РейтингЦБ"" КАК Принадлежность,
		|	_ЛучшиеРейтингиБумаги.Субъект КАК Субъект,
		|	_ЛучшиеРейтингиБумаги.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	_ЛучшиеРейтингиБумаги.ТипШкалы КАК ТипШкалы,
		|	_ЛучшиеРейтингиБумаги.ВидРейтинга КАК ВидРейтинга,
		|	_ЛучшиеРейтингиБумаги.Рейтинг КАК Рейтинг,
		|	_ЛучшиеРейтингиБумаги.ОценкаРейтинга КАК ОценкаРейтинга
		|ПОМЕСТИТЬ _РейтингиЦенныхБумаг
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЛучшиеРейтинги КАК _ЛучшиеРейтингиБумаги
		|		ПО (_ЛучшиеРейтингиБумаги.Субъект = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиЦенныхБумаг.Организация,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага,
		|	""РейтингЭмитента"",
		|	_ЛучшиеРейтингиЭмитента.Субъект,
		|	_ЛучшиеРейтингиЭмитента.РейтинговоеАгентство,
		|	_ЛучшиеРейтингиЭмитента.ТипШкалы,
		|	_ЛучшиеРейтингиЭмитента.ВидРейтинга,
		|	_ЛучшиеРейтингиЭмитента.Рейтинг,
		|	_ЛучшиеРейтингиЭмитента.ОценкаРейтинга
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РеквизитыБумаг КАК _РеквизитыБумаг
		|		ПО (_РеквизитыБумаг.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЛучшиеРейтинги КАК _ЛучшиеРейтингиЭмитента
		|		ПО (_ЛучшиеРейтингиЭмитента.Субъект = _РеквизитыБумаг.Эмитент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиЦенныхБумаг.Организация,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага,
		|	""РейтингОригинатора"",
		|	_ЛучшиеРейтингиОригинатора.Субъект,
		|	_ЛучшиеРейтингиОригинатора.РейтинговоеАгентство,
		|	_ЛучшиеРейтингиОригинатора.ТипШкалы,
		|	_ЛучшиеРейтингиОригинатора.ВидРейтинга,
		|	_ЛучшиеРейтингиОригинатора.Рейтинг,
		|	_ЛучшиеРейтингиОригинатора.ОценкаРейтинга
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РеквизитыБумаг КАК _РеквизитыБумаг
		|		ПО (_РеквизитыБумаг.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЛучшиеРейтинги КАК _ЛучшиеРейтингиОригинатора
		|		ПО (_ЛучшиеРейтингиОригинатора.Субъект = _РеквизитыБумаг.Оригинатор)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ОстаткиЦенныхБумаг.Организация,
		|	_ОстаткиЦенныхБумаг.СчетДоверительногоУправления,
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага,
		|	""РейтингГаранта"",
		|	_ЛучшиеРейтингиГаранта.Субъект,
		|	_ЛучшиеРейтингиГаранта.РейтинговоеАгентство,
		|	_ЛучшиеРейтингиГаранта.ТипШкалы,
		|	_ЛучшиеРейтингиГаранта.ВидРейтинга,
		|	_ЛучшиеРейтингиГаранта.Рейтинг,
		|	_ЛучшиеРейтингиГаранта.ОценкаРейтинга
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РеквизитыБумаг КАК _РеквизитыБумаг
		|		ПО (_РеквизитыБумаг.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЛучшиеРейтинги КАК _ЛучшиеРейтингиГаранта
		|		ПО (_ЛучшиеРейтингиГаранта.Субъект = _РеквизитыБумаг.Гарант)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	СчетДоверительногоУправления,
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""РейтингЦБ"" КАК Принадлежность
		|ПОМЕСТИТЬ _Принадлежности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РейтингЭмитента""
		|ГДЕ
		|	&ДополнятьРейтингамиЭмитента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РейтингОригинатора""
		|ГДЕ
		|	&ДополнятьРейтингамиОригинатора
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""РейтингГаранта""
		|ГДЕ
		|	&ДополнятьРейтингамиГаранта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЛучшиеРейтинги.РейтинговоеАгентство КАК РейтинговоеАгентство
		|ПОМЕСТИТЬ _РейтинговыеАгентства
		|ИЗ
		|	_ЛучшиеРейтинги КАК _ЛучшиеРейтинги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОстаткиЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПРЕДСТАВЛЕНИЕ(_ОстаткиЦенныхБумаг.ЦеннаяБумага) КАК ЦеннаяБумагаПредставление,
		|	_РейтинговыеАгентства.РейтинговоеАгентство КАК РейтинговоеАгентство,
		|	ПРЕДСТАВЛЕНИЕ(_РейтинговыеАгентства.РейтинговоеАгентство) КАК РейтинговоеАгентствоПредставление,
		|	_Принадлежности.Принадлежность КАК Принадлежность,
		|	_РейтингиЦенныхБумаг.ТипШкалы КАК ТипШкалы,
		|	ПРЕДСТАВЛЕНИЕ(_РейтингиЦенныхБумаг.ТипШкалы) КАК ТипШкалыПредставление,
		|	_РейтингиЦенныхБумаг.ВидРейтинга КАК ВидРейтинга,
		|	ПРЕДСТАВЛЕНИЕ(_РейтингиЦенныхБумаг.ВидРейтинга) КАК ВидРейтингаПредставление,
		|	_РейтингиЦенныхБумаг.Рейтинг КАК Рейтинг,
		|	ПРЕДСТАВЛЕНИЕ(_РейтингиЦенныхБумаг.Рейтинг) КАК РейтингПредставление,
		|	_РейтингиЦенныхБумаг.ОценкаРейтинга КАК ОценкаРейтинга
		|ИЗ
		|	_ОстаткиЦенныхБумаг КАК _ОстаткиЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтинговыеАгентства КАК _РейтинговыеАгентства
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Принадлежности КАК _Принадлежности
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РейтингиЦенныхБумаг КАК _РейтингиЦенныхБумаг
		|		ПО (_РейтингиЦенныхБумаг.Организация = _ОстаткиЦенныхБумаг.Организация)
		|			И (_РейтингиЦенныхБумаг.СчетДоверительногоУправления = _ОстаткиЦенныхБумаг.СчетДоверительногоУправления)
		|			И (_РейтингиЦенныхБумаг.ЦеннаяБумага = _ОстаткиЦенныхБумаг.ЦеннаяБумага)
		|			И (_РейтингиЦенныхБумаг.РейтинговоеАгентство = _РейтинговыеАгентства.РейтинговоеАгентство)
		|			И (_РейтингиЦенныхБумаг.Принадлежность = _Принадлежности.Принадлежность)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеннаяБумага,
		|	РейтинговоеАгентство
		|ИТОГИ
		|	МАКСИМУМ(Рейтинг)
		|ПО
		|	ЦеннаяБумага,
		|	РейтинговоеАгентство,
		|	Принадлежность
		|АВТОУПОРЯДОЧИВАНИЕ");
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ТекущаяДата",					ТекущаяДата());
	Запрос.УстановитьПараметр("Организация",					ЭтотОбъект.Организация);
	
	Запрос.УстановитьПараметр("РейтинговыеАгентства",			ЭтотОбъект.РейтинговыеАгентства);
	Запрос.УстановитьПараметр("БезФильтраРейтинговыхАгентств",	Не ЗначениеЗаполнено(ЭтотОбъект.РейтинговыеАгентства));
	
	Запрос.УстановитьПараметр("Клиенты",						ЭтотОбъект.Клиенты);
	Запрос.УстановитьПараметр("БезФильтраКлиентов",				Не ЗначениеЗаполнено(ЭтотОбъект.Клиенты));
	
	Запрос.УстановитьПараметр("ДополнятьРейтингамиЭмитента",	ЭтотОбъект.ДополнятьРейтингамиЭмитента);
	Запрос.УстановитьПараметр("ДополнятьРейтингамиОригинатора",	ЭтотОбъект.ДополнятьРейтингамиОригинатора);
	Запрос.УстановитьПараметр("ДополнятьРейтингамиГаранта",		ЭтотОбъект.ДополнятьРейтингамиГаранта);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОстаткиЦенныхБумаг = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОстаткиЦенныхБумаг"].ПолучитьДанные().Выгрузить();
	ОстаткиЦенныхБумаг.Индексы.Добавить("ЦеннаяБумага");
	ОстаткиЦенныхБумаг.Сортировать("СчетДоверительногоУправления");
	
	ТаблицаРейтинговыхАгентств = Запрос.МенеджерВременныхТаблиц.Таблицы["_РейтинговыеАгентства"].ПолучитьДанные().Выгрузить();
	ТаблицаРейтинговыхАгентств.Сортировать("РейтинговоеАгентство");
	
	Макет = ПолучитьМакет("Макет");
	
	ДокументРезультат.Вывести(Макет.ПолучитьОбласть("Шапка|ЦеннаяБумага"));
	
	Для каждого СтрокаРГ Из ТаблицаРейтинговыхАгентств Цикл
		
		ОбластьРА = Макет.ПолучитьОбласть("Шапка|РейтингСовокупный");
		ОбластьРА.Параметры.Заполнить(СтрокаРГ);
		
		ДокументРезультат.Присоединить(ОбластьРА);		
		ДокументРезультат.НачатьГруппуКолонок(Неопределено, Ложь);
		
		ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|РейтингЦБ"));
		
		Если ЭтотОбъект.ДополнятьРейтингамиЭмитента Тогда
			ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|РейтингЭмитента"));
		КонецЕсли;	
			
		Если ЭтотОбъект.ДополнятьРейтингамиОригинатора Тогда
			ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|РейтингОригинатора"));
		КонецЕсли;	
		
		Если ЭтотОбъект.ДополнятьРейтингамиГаранта Тогда
			ДокументРезультат.Присоединить(Макет.ПолучитьОбласть("Шапка|РейтингГаранта"));
		КонецЕсли;	
		
		ДокументРезультат.ЗакончитьГруппуКолонок();
		
	КонецЦикла; 
	
	ВыборкаЦеннойБумаги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЦеннойБумаги.Следующий() Цикл
		
		ОбластьЦеннаяБумага = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|ЦеннаяБумага");
		ОбластьЦеннаяБумага.Параметры.Заполнить(ВыборкаЦеннойБумаги);
		
		Если Не ЗначениеЗаполнено(ВыборкаЦеннойБумаги.Рейтинг) Тогда
			ОбластьЦеннаяБумага.Область().ЦветТекста = WebЦвета.Красный;	
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьЦеннаяБумага);
		
		ДокументРезультат.НачатьГруппуСтрок(Неопределено, Ложь);
		
		ВыборкаРейтинговыхАгентств = ВыборкаЦеннойБумаги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРейтинговыхАгентств.Следующий() Цикл
			
			РейтингиРА = Новый Структура;
			СовокупныйРейтинг = Новый Массив;
			
			ВыборкаПринадлежности = ВыборкаРейтинговыхАгентств.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПринадлежности.Следующий() Цикл
				
				ВыборкаРейтингов = ВыборкаПринадлежности.Выбрать(ОбходРезультатаЗапроса.Прямой);
				
				Пока ВыборкаРейтингов.Следующий() И ЗначениеЗаполнено(ВыборкаРейтингов.Рейтинг) Цикл
					
					ПредставлениеРейтинга = Строка(ВыборкаРейтингов.Рейтинг) + "; " + Строка(ВыборкаРейтингов.ТипШкалы) + "; " + Строка(ВыборкаРейтингов.ВидРейтинга);
					
					РейтингиРА.Вставить(
						ВыборкаРейтингов.Принадлежность,
						?(РейтингиРА.Свойство(ВыборкаРейтингов.Принадлежность), РейтингиРА[ВыборкаРейтингов.Принадлежность] + Символы.ПС, "")
							+ ПредставлениеРейтинга);
							
					СовокупныйРейтинг.Добавить(ПредставлениеРейтинга);		
							
				КонецЦикла;		
				
			КонецЦикла;		
			
			РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(СовокупныйРейтинг);
			РейтингиРА.Вставить("РейтингСовокупный", СтрСоединить(СовокупныйРейтинг, Символы.ПС));
			
			ОбластьРА = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|РейтингСовокупный");
			ОбластьРА.Параметры.Заполнить(ВыборкаРейтинговыхАгентств);
			ОбластьРА.Параметры.Заполнить(РейтингиРА);
			ДокументРезультат.Присоединить(ОбластьРА);
			
			ОбластьРА = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|РейтингЦБ");
			ОбластьРА.Параметры.Заполнить(ВыборкаРейтинговыхАгентств);
			ОбластьРА.Параметры.Заполнить(РейтингиРА);
			ДокументРезультат.Присоединить(ОбластьРА);
			
			Если ЭтотОбъект.ДополнятьРейтингамиЭмитента Тогда
				ОбластьРА = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|РейтингЭмитента");
				ОбластьРА.Параметры.Заполнить(ВыборкаРейтинговыхАгентств);
				ОбластьРА.Параметры.Заполнить(РейтингиРА);
				ДокументРезультат.Присоединить(ОбластьРА);
			КонецЕсли;	
				
			Если ЭтотОбъект.ДополнятьРейтингамиОригинатора Тогда
				ОбластьРА = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|РейтингОригинатора");
				ОбластьРА.Параметры.Заполнить(ВыборкаРейтинговыхАгентств);
				ОбластьРА.Параметры.Заполнить(РейтингиРА);
				ДокументРезультат.Присоединить(ОбластьРА);
			КонецЕсли;	
			
			Если ЭтотОбъект.ДополнятьРейтингамиГаранта Тогда
				ОбластьРА = Макет.ПолучитьОбласть("СтрокаЦеннойБумаги|РейтингГаранта");
				ОбластьРА.Параметры.Заполнить(ВыборкаРейтинговыхАгентств);
				ОбластьРА.Параметры.Заполнить(РейтингиРА);
				ДокументРезультат.Присоединить(ОбластьРА);
			КонецЕсли;
			
		КонецЦикла;		
		
		СчетаДУ = ОстаткиЦенныхБумаг.НайтиСтроки(Новый Структура("ЦеннаяБумага", ВыборкаЦеннойБумаги.ЦеннаяБумага));
		
		Для каждого СчетДУ Из СчетаДУ Цикл
		
			ОбластьСчетДУ = Макет.ПолучитьОбласть("СтрокаКлиента");
			ОбластьСчетДУ.Параметры.Заполнить(ВыборкаЦеннойБумаги);
			ОбластьСчетДУ.Параметры.Заполнить(СчетДУ);
			
			ДокументРезультат.Вывести(ОбластьСчетДУ);		
		
		КонецЦикла;  
		
		ДокументРезультат.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
	// Параметры печати и пр.
	
	ДокументРезультат.ФиксацияСверху = Макет.ПолучитьОбласть("Шапка").ВысотаТаблицы;
	ДокументРезультат.ФиксацияСлева	 = Макет.ПолучитьОбласть("ЦеннаяБумага").ШиринаТаблицы;
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, Механизм, Истина, ОриентацияСтраницы.Ландшафт);
	
	// Фиксация сессии статистики
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия); 
	
КонецПроцедуры
